{"config": {"layers": [{"config": {"kernel_constraint": null, "strides": [1, 1], "padding": "valid", "filters": 32, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_1", "dtype": "float32", "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 80, 60, 1], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout", "trainable": true, "seed": null, "rate": 0.2, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "softmax", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense", "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 4, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential"}